"""
Задание 2.

Каждое из слов "class", "function", "method" записать в байтовом формате
без преобразования в последовательность кодов
не используя!!! методы encode и decode)
и определить тип, содержимое и длину соответствующих переменных.

Подсказки:
--- b'class' - используйте маркировку b''
--- используйте списки и циклы, не дублируйте функции
"""

text1, text4, text3 =  b"class", b"function", b"method"
print(text3) 
print(type(text3))
print(len(text3))
